> ```
> Terraform will perform the following actions:
> 
>   # aws_route53_record.pub_CNAME_sendgrid_1 will be created
>   + resource "aws_route53_record" "pub_CNAME_sendgrid_1" {
>       + allow_overwrite = (known after apply)
>       + fqdn            = (known after apply)
>       + id              = (known after apply)
>       + name            = "url5402.binbash.com.ar"
>       + records         = [
>           + "sendgrid.net",
>         ]
>       + ttl             = 300
>       + type            = "CNAME"
>       + zone_id         = "Z1F75NUGYJVN3L"
>     }
> 
>   # aws_route53_record.pub_CNAME_sendgrid_2 will be created
>   + resource "aws_route53_record" "pub_CNAME_sendgrid_2" {
>       + allow_overwrite = (known after apply)
>       + fqdn            = (known after apply)
>       + id              = (known after apply)
>       + name            = "26974810.binbash.com.ar"
>       + records         = [
>           + "sendgrid.net",
>         ]
>       + ttl             = 300
>       + type            = "CNAME"
>       + zone_id         = "Z1F75NUGYJVN3L"
>     }
> 
>   # aws_route53_record.pub_CNAME_sendgrid_3 will be created
>   + resource "aws_route53_record" "pub_CNAME_sendgrid_3" {
>       + allow_overwrite = (known after apply)
>       + fqdn            = (known after apply)
>       + id              = (known after apply)
>       + name            = "em8184.binbash.com.ar"
>       + records         = [
>           + "u26974810.wl061.sendgrid.net",
>         ]
>       + ttl             = 300
>       + type            = "CNAME"
>       + zone_id         = "Z1F75NUGYJVN3L"
>     }
> 
>   # aws_route53_record.pub_CNAME_sendgrid_4 will be created
>   + resource "aws_route53_record" "pub_CNAME_sendgrid_4" {
>       + allow_overwrite = (known after apply)
>       + fqdn            = (known after apply)
>       + id              = (known after apply)
>       + name            = "s1._domainkey.binbash.com.ar"
>       + records         = [
>           + "s1.domainkey.u26974810.wl061.sendgrid.net",
>         ]
>       + ttl             = 300
>       + type            = "CNAME"
>       + zone_id         = "Z1F75NUGYJVN3L"
>     }
> 
>   # aws_route53_record.pub_CNAME_sendgrid_5 will be created
>   + resource "aws_route53_record" "pub_CNAME_sendgrid_5" {
>       + allow_overwrite = (known after apply)
>       + fqdn            = (known after apply)
>       + id              = (known after apply)
>       + name            = "s2._domainkey.binbash.com.ar"
>       + records         = [
>           + "s2.domainkey.u26974810.wl061.sendgrid.net",
>         ]
>       + ttl             = 300
>       + type            = "CNAME"
>       + zone_id         = "Z1F75NUGYJVN3L"
>     }
> 
> Plan: 5 to add, 0 to change, 0 to destroy.
> ╷
> │ Warning: Value for undeclared variable
> │ 
> │ The root module does not declare a variable named "sso_start_url" but a value was found in file
> │ "/binbash/config/common.tfvars". If you meant to use this value, add a "variable" block to the configuration.
> │ 
> │ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all
> │ configurations in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
> ╵
> ╷
> │ Warning: Value for undeclared variable
> │ 
> │ The root module does not declare a variable named "region_primary" but a value was found in file
> │ "/binbash/config/common.tfvars". If you meant to use this value, add a "variable" block to the configuration.
> │ 
> │ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all
> │ configurations in your organization. To reduce the verbosity of these warnings, use the -compact-warnings option.
> ╵
> ╷
> │ Warning: Values for undeclared variables
> │ 
> │ In addition to the other similar warnings shown, 7 other variable(s) defined without being declared.
> ╵
> 
> ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
> 
> Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if
> you run "terraform apply" now.
> Releasing state lock. This may take a few moments...
> ```

@mpagnucco it looks great!!! Approved!! 🚀 